In [1]:
import pandas as pd

In [2]:
two_dimensional_list = [['frank', 'M', 29], ['mary', 'F', 23], ['tom', 'M', 35], ['ted', 'M', 33], ['jean', 'F', 21], ['lisa', 'F', 20]]

In [9]:
my_df = pd.DataFrame(two_dimensional_list, columns=['name', 'sex', 'age'], index=['a', 'b', 'c', 'd', 'e', 'f'])
my_df

    name sex  age
a  frank   M   29
b   mary   F   23
c    tom   M   35
d    ted   M   33
e   jean   F   21
f   lisa   F   20

In [8]:
type(my_df)

pandas.core.frame.DataFrame

In [11]:
my_df.columns

Index(['name', 'sex', 'age'], dtype='object')

In [10]:
my_df.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [12]:
my_df.dtypes

name    object
sex     object
age      int64
dtype: object

In [13]:
import pandas as pd

list = [['Taylor Swift', 'December 13, 1989', 'Singer-songwriter'],
        ['Aaron Sorkin', 'June 9, 1961', 'Screenwriter'],
        ['Harry Potter', 'July 31, 1980', 'Wizard'],
        ['Ji-Sung Park', 'February 25, 1981', 'Footballer']]

df = pd.DataFrame(list, columns=['name','birthday','occupation'])
df

           name           birthday         occupation
0  Taylor Swift  December 13, 1989  Singer-songwriter
1  Aaron Sorkin       June 9, 1961       Screenwriter
2  Harry Potter      July 31, 1980             Wizard
3  Ji-Sung Park  February 25, 1981         Footballer

In [30]:
iphone_df = pd.read_csv('iphone.csv')
iphone_df

              기종         출시일  디스플레이  메모리     출시 버전 Face ID
0       iPhone 7  2016-09-16    4.7  2GB  iOS 10.0      No
1  iPhone 7 Plus  2016-09-16    5.5  3GB  iOS 10.0      No
2       iPhone 8  2017-09-22    4.7  2GB  iOS 11.0      No
3  iPhone 8 Plus  2017-09-22    5.5  3GB  iOS 11.0      No
4       iPhone X  2017-11-03    5.8  3GB  iOS 11.1     Yes
5      iPhone XS  2018-09-21    5.8  4GB  iOS 12.0     Yes
6  iPhone XS Max  2018-09-21    6.5  4GB  iOS 12.0     Yes

In [15]:
type(iphone_df)

pandas.core.frame.DataFrame

In [31]:
import pandas as pd

names = pd.read_csv('popular_baby_names.csv')
df = pd.DataFrame(names)
df

,Year of Birth,Gender,Ethnicity,Child's First Name,Count,Rank
0,2016,FEMALE,ASIAN AND PACIFIC ISLANDER,Olivia,172,1
1,2016,FEMALE,ASIAN AND PACIFIC ISLANDER,Chloe,112,2
2,2016,FEMALE,ASIAN AND PACIFIC ISLANDER,Sophia,104,3
3,2016,FEMALE,ASIAN AND PACIFIC ISLANDER,Emily,99,4
4,2016,FEMALE,ASIAN AND PACIFIC ISLANDER,Emma,99,4
...,...,...,...,...,...,...
11340,2011,MALE,WHITE NON HISPANIC,LEV,10,97
11341,2011,MALE,WHITE NON HISPANIC,AUGUSTUS,10,97
11342,2011,MALE,WHITE NON HISPANIC,SHAUL,10,97
11343,2011,MALE,WHITE NON HISPANIC,WESLEY,10,97
11344,2011,MALE,WHITE NON HISPANIC,KENNETH,10,97

In [ ]:
import pandas as pd

# 여기에 코드를 작성하세요
data = pd.read_csv('mega_millions.csv', index_col=0)
df = pd.DataFrame(data)
# 테스트 코드
df